blogs/SYN-cookies.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SYN cookies HOWTO</title>
<!-- 2016-01-09 六 18:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="zzyongx" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">SYN cookies HOWTO</h1>
<p>
说起<a href="https://en.wikipedia.org/wiki/SYN_cookies">SYN cookies</a>，就不得不先说<a href="https://en.wikipedia.org/wiki/SYN_flood">SYN flood</a>，而说起SYN flood就不得不先说 <code>TCP</code> 三次握手。
</p>

<div class="org-src-container">

<pre class="src src-ditta">Alice  --&gt;-- SYN     --&gt;-- Server
Server --&gt;-- SYN-ACK --&gt;-- Alice
Alice  --&gt;-- ACK     --&gt;-- Server
</pre>
</div>

<p>
这个是正常的三次握手，最后Alice向Server回复 <code>ACK</code> ，三次握手完成。
</p>

<div class="org-src-container">

<pre class="src src-ditta">Hack   --&gt;-- SYN     --&gt;-- Server
Hack   --&gt;-- SYN     --&gt;-- Server
Hack   --&gt;-- SYN     --&gt;-- Server
Server --&gt;-- SYN-ACK --&gt;-- Hack
Server --&gt;-- SYN-ACK --&gt;-- Hack
Server --&gt;-- SYN-ACK --&gt;-- Hack
</pre>
</div>

<p>
上面Hack向Server发送了 <code>SYN</code> ，但是或者Hack故意不回复 <code>ACK</code> ，或者Hack向Server发送 <code>SYN</code> 时伪造了源IP地址。Server收不到最后的 <code>ACK</code> ，最终处于半连接状态。
</p>

<p>
当Hack发送大量的 <code>SYN</code> 时，Server端保留了大量的半连接，占用了大量的资源，此时Alice发送正常的 <code>SYN</code> ，Server却无法响应了。这种情况，就是Hack利用 <code>SYN flood</code> 发起了 <a href="https://en.wikipedia.org/wiki/Denial-of-service_attack">DOS</a> 攻击。
</p>

<p>
<code>SYN cookie</code> 正是为了解决 <code>SYN flood</code> 才出现的。 <code>SYN flood</code> 造成 <code>DOS</code> 的关键是半连接，占用了Server的资源，如果能消除半连接占的资源，那么就可以防止 <code>SYN flood</code> 。 
</p>

<p>
<code>TCP</code> 规定，每次 <code>ACK</code> 都要把收到的包的 <code>sequence number</code> 加1发送回去。 <code>SYN cookie</code> 的解决思路是，把半连接保存的资源放到 <code>sequence number</code> 中，收到 <code>ACK</code> 时把 <code>sequence number</code> 减1，从中恢复需要的资源。 <code>sequence number</code> 只有32位，能保存的资源有限，5位保存时间，3位保存TCP选项 <code>MSS</code> ，剩下24位保存一个加密串，具体实现参考<a href="https://en.wikipedia.org/wiki/SYN_cookies">wiki</a>。
</p>

<p>
<code>SYN cookie</code> 有2个缺陷。首先，如果Alice发送的ACK <b>丢失</b> ，因为服务器没有保留半连接信息，所以它无法通过重发 <code>SYN ACK</code> 来让Alice重发 <code>ACK</code> ，当Alice的 <code>ACK</code> 丢失时，Alice认为连接建立，Server则根本没有这个连接。如果建立连接后是Server先发数据，Alice则只能通过超时发现问题。其次，因为 <code>sequence number</code> 只有32位，只保留了 <code>MSS</code> 这个TCP选项，这在早期不是问题，TCP选择逐渐增多，这些选项也非常重要，它们无法保存在 <code>sequence number</code> 中。
</p>

<p>
在<a href="http://lwn.net/Articles/277146/">改进SYN cookie</a> 中，通过在TCP timestamp中保存更多的TCP选项，解决了缺陷2。在此文中提到，SYN cookie的最初作者认为SYN cookie可能已经没有必要了，因为现在Server性能强劲，内存常有富裕，半连接占用的资源已经可以忽略了。但是测试似乎表明 SYN cookie 提升了响应时间，虽然略有CPU的提升，另外在有SYN flood的情况下，SYN cookie开启要由于不开启。
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: zzyongx</p>
<p class="date">Created: 2016-01-09 六 18:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
